tap "arkweid/lefthook"
tap "attheodo/formulae"
tap "dteoh/sqa"
tap "evilmartians/lefthook"
tap "federico-terzi/espanso"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "teamookla/speedtest"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "wpscanteam/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Reimplementation of ctags(1)
brew "ctags", link: false
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Text processing system for reStructuredText
brew "docutils"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# GNU grep, egrep and fgrep
brew "grep"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Command-line benchmarking tool
brew "hyperfine"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Multi-format archive and compression library
brew "libarchive"
# GNOME XML library
brew "libxml2"
# C XSLT library for GNOME
brew "libxslt"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# RC file (dotfile) management
brew "rcm"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Shell commands for environment parity for Heroku apps
brew "thoughtbot/formulae/parity"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# All-in-one toolbox for developers
cask "devutils"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Tools to protect your emails and files
cask "gpg-suite"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source code editor
cask "visual-studio-code"
