tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "universal-ctags/universal-ctags"
brew "asdf"
brew "automake"
brew "awscli"
brew "bash-completion@2"
brew "bash"
brew "bat"
brew "broot"
brew "cheat"
brew "chezmoi"
brew "choose-gui"
brew "cloc"
brew "coreutils"
brew "cowsay"
brew "ctop"
brew "curl"
brew "direnv"
brew "dive"
brew "exa"
brew "exiftool"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-delta"
brew "git"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "gnutls"
brew "go"
brew "grep"
brew "highlight"
brew "htop"
brew "imagemagick"
brew "imagemagick@6"
brew "jless"
brew "jq"
brew "less"
brew "lesspipe"
brew "libarchive"
brew "libevent"
brew "libffi"
brew "libheif"
brew "libidn"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "lsd"
brew "lynx"
brew "make"
brew "mas"
brew "mysql@5.7"
brew "ncdu"
brew "neovim"
brew "node"
brew "openconnect"
brew "p11-kit"
brew "pandoc"
brew "postgresql@14"
brew "prettyping"
brew "protobuf"
brew "python@3.11"
brew "python@3.9"
brew "redis"
brew "ripgrep-all"
brew "ripgrep"
brew "s3cmd"
brew "shared-mime-info"
brew "smartmontools"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "tree"
brew "unbound"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unixodbc"
brew "unzip"
brew "v8"
brew "vim"
brew "wget"
brew "xz"
brew "yarn"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
cask "amethyst"
cask "cheatsheet"
cask "chromedriver"
cask "espanso"
cask "fig"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "iterm2"
cask "kitty"
cask "ngrok"
cask "obsidian"
cask "qlstephen"
cask "qlvideo"
cask "tunnelblick"
cask "visual-studio-code"
cask "warp"
cask "webpquicklook"
